a = int(input("vvedi 1"))
b = int(input("vvedi 10"))
for i in range(a, b + 1):
    print(i)


#Даны числа a и b (a < b). Выведите сумму всех натуральных
# чисел от a до b (включительно).